Revit 2027 API
LightNode Methods
The LightNode type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAsset |  Returns an an instance of an Asset object, which contains definitions of the content node.
(Inherited from ContentNode)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTransform |  A transformation matrix associated with the node.
(Inherited from ContentNode)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
LightNode Class
Autodesk.Revit.DB Namespace